# DATA GROUPING

---

The table below shows the number of visits to a certain online store and the number of products purchased.

| Day    | Browser | Visits | Purchase |
| ------ | ------- | ------ | -------- |
| Monday | Edge    | 15     | 3        |
| Monday | Chrome  | 17     | 1        |
| Monday | Safari  | 11     | 2        |
| Friday | Edge    | 10     | 2        |
| Friday | Safari  | 23     | 7        |
| Sunday | Chrome  | 34     | 12       |

In [1]:
import pandas as pd

visits_data = {
    "Day": ["Monday", "Monday", "Monday", "Friday", "Friday", "Sunday"],
    "Browser": ["Edge", "Chrome", "Safari", "Edge", "Safari", "Chrome"],
    "Visits": [15, 17, 11, 10, 23, 34],
    "Purchase": [3, 1, 2, 2, 7, 12],
}
visits = pd.DataFrame(visits_data)
visits

      Day Browser  Visits  Purchase
0  Monday    Edge      15         3
1  Monday  Chrome      17         1
2  Monday  Safari      11         2
3  Friday    Edge      10         2
4  Friday  Safari      23         7
5  Sunday  Chrome      34        12

To calculate and display the total number of visits on individual days of the week, specify the result columns, the columns by which the data are grouped and the aggregation function:

In [2]:
visits.loc[:, ["Day", "Visits"]].groupby(["Day"]).sum()

        Visits
Day
Friday      33
Monday      43
Sunday      34

If you also want to calculate the total of products purchased for each week, add the column name 'Purchase' to the list of result columns.

In [3]:
visits.loc[:, ["Day", "Visits", "Purchase"]].groupby(["Day"]).sum()

        Visits  Purchase
Day
Friday      33         9
Monday      43         6
Sunday      34        12

### Tasks

Calculate and display the average number of website visits by day of the week, depending on the web browser.

In [4]:
visits.loc[:, ["Day", "Browser", "Visits"]].groupby(["Day", "Browser"]).mean()

                Visits
Day    Browser
Friday Edge       10.0
       Safari     23.0
Monday Chrome     17.0
       Edge       15.0
       Safari     11.0
Sunday Chrome     34.0

Calculate and display the number of web browsers used on specific days of the week.

In [5]:
visits.loc[:, ["Day", "Browser"]].groupby("Day").count()

        Browser
Day
Friday        2
Monday        3
Sunday        1

Calculate and display the number of web browsers used on specific days of the week. Sort the results in descending order.

In [6]:
visits.loc[:, ["Day", "Browser"]].groupby("Day").count().sort_values(
    "Browser", ascending=False
)

        Browser
Day
Monday        3
Friday        2
Sunday        1

The 'employees.csv' file contains data of employees of one of the IT companies. Display employee list. Then, calculate and display:

In [7]:
employees = pd.read_csv("employees.csv")
employees

,first_name,last_name,sex,age,country,job_title,start_date,salary
0,Lucho,Maytum,Male,37,United Kingdom,Mechanical Systems Engineer,2/10/2016,148308.96
1,Torrance,Brandi,Male,60,Czech Republic,Paralegal,8/12/2020,57026.74
2,Missie,Kulic,Female,49,Poland,Business Systems Development Analyst,2/21/2015,133566.77
3,Rickie,Somerville,Male,39,Czech Republic,Speech Pathologist,3/11/2014,53750.68
4,Gawen,Richarz,Male,50,Poland,Senior Cost Accountant,7/19/2019,115606.12
5,Sadella,Batterham,Female,37,Czech Republic,Assistant Media Planner,1/14/2017,136875.05
6,Meghann,Dance,Female,20,Czech Republic,Media Manager II,6/10/2014,44973.70
7,Obidiah,Bradburn,Male,49,Czech Republic,Geological Engineer,12/2/2010,64912.33
8,Dolph,Mesnard,Male,53,Czech Republic,Automation Specialist II,7/21/2012,82159.90
9,Fabien,McLanaghan,Male,48,Czech Republic,Graphic Designer,12/1/2021,63059.52
10,Shaina,Gaveltone,Female,58,Poland,Web Designer II,9/12/2010,21228.29
11,Annemarie,Albers,Female,50,Poland,Structural Analysis Engineer,3/12/2020,109840.09
12,Erinn,Borell,Female,36,Czech Republic,Help Desk Technician,11/6/2011,22500.03
13,Loydie,Cubbinelli,Male,35,Czech Republic,Systems Administrator IV,5/13/2014,34415.64
14,Osbourne,Rawet,Male,50,Poland,Office Assistant III,8/12/2021,41511.02
15,Ettore,Ernke,Male,49,Poland,Environmental Specialist,3/14/2022,103866.10
16,Mortie,Goodayle,Male,56,Czech Republic,Product Engineer,5/18/2011,40060.88
17,Courtnay,Creevy,Male,61,Czech Republic,Legal Assistant,1/14/2015,57492.08
18,Rochella,Slym,Female,19,Poland,Account Representative I,10/5/2019,105826.54
19,Frannie,McMorran,Male,47,Poland,Budget/Accounting Analyst II,3/31/2020,39107.88

- Number of women and men

In [8]:
employees.loc[:, ["sex", "last_name"]].groupby("sex").count().rename(
    columns={"last_name": "number"}
)

        number
sex
Female       7
Male        13

- Number of employees by country

In [9]:
employees.loc[:, ["country", "last_name"]].groupby("country").count().rename(
    columns={"last_name": "number"}
)

                number
country
Czech Republic      11
Poland               8
United Kingdom       1

- Number of women and men by country

In [10]:
employees.loc[:, ["country", "sex", "last_name"]].groupby(
    ["country", "sex"]
).count().rename(columns={"last_name": "number"})

                       number
country        sex
Czech Republic Female       3
               Male         8
Poland         Female       4
               Male         4
United Kingdom Male         1

- Average age of employees

In [11]:
employees["age"].mean()

45.15

- Average age of women and men

In [12]:
employees.loc[:, ["sex", "age"]].groupby("sex").mean()

              age
sex
Female  38.428571
Male    48.769231

- Average salary in the company.

In [13]:
employees["salary"].mean()

73804.416

- Average salary of women and men

In [14]:
employees.loc[:, ["sex", "salary"]].groupby("sex").mean()

              salary
sex
Female  82115.781429
Male    69329.065385

- Minimum age of women and men by country. Sort the results in descending order.

In [16]:
employees.loc[:, ["country", "sex", "age"]].groupby(
    ["country", "sex"]
).min().sort_values("age", ascending=False)

                       age
country        sex
Poland         Male     47
United Kingdom Male     37
Czech Republic Male     35
               Female   20
Poland         Female   19

- Median salary of women and men by country.

In [18]:
employees.loc[:, ["country", "sex", "salary"]].groupby(["country", "sex"]).median()

                           salary
country        sex
Czech Republic Female   44973.700
               Male     57259.410
Poland         Female  107833.315
               Male     72688.560
United Kingdom Male    148308.960

- Median salary of women and men by country. Save the results to a csv file.

In [20]:
employees.loc[:, ["country", "sex", "salary"]].groupby(
    ["country", "sex"]
).median().to_csv("employees_median.csv")

pd.read_csv("employees_median.csv")

          country     sex      salary
0  Czech Republic  Female   44973.700
1  Czech Republic    Male   57259.410
2          Poland  Female  107833.315
3          Poland    Male   72688.560
4  United Kingdom    Male  148308.960